In [350]:
import pandas as pd
import numpy as np
pd.options.mode.chained_assignment = None

# №1

In [351]:
file_names_1 = []
for i in range(10):
    file_names_1.append("/home/nogaromo/Data/Students_info_"+str(i)+".csv")

In [352]:
data_all_1 = pd.concat((pd.read_csv(i) for i in file_names_1)).reset_index(drop=True)

In [353]:
file_names_2 = []
for i in range(10):
    file_names_2.append("/home/nogaromo/Data/Students_marks_"+str(i)+".csv")

In [354]:
data_all_2 = pd.concat((pd.read_csv(i) for i in file_names_2)).reset_index(drop=True)

In [355]:
df = pd.concat([data_all_1, data_all_2], axis=1)
df

,index,gender,race/ethnicity,parental level of education,lunch,test preparation course,group,index,math score,reading score,writing score
0,0,female,group B,bachelor's degree,standard,none,group1,0,72,72,74
1,1,female,group C,some college,standard,completed,group1,1,69,90,88
2,2,female,group B,master's degree,standard,none,group1,2,90,95,93
3,3,male,group A,associate's degree,free/reduced,none,group1,3,47,57,44
4,4,male,group C,some college,standard,none,group1,4,76,78,75
...,...,...,...,...,...,...,...,...,...,...,...
995,995,female,group E,master's degree,standard,completed,group10,995,88,99,95
996,996,male,group C,high school,free/reduced,none,group10,996,62,55,55
997,997,female,group C,high school,free/reduced,completed,group10,997,59,71,65
998,998,female,group D,some college,standard,completed,group10,998,68,78,77
999,999,female,group D,some college,free/reduced,none,group10,999,77,86,86

# №2

In [356]:
df = df.drop('index', axis=1)

In [357]:
df.head(10)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,group,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,group1,72,72,74
1,female,group C,some college,standard,completed,group1,69,90,88
2,female,group B,master's degree,standard,none,group1,90,95,93
3,male,group A,associate's degree,free/reduced,none,group1,47,57,44
4,male,group C,some college,standard,none,group1,76,78,75
5,female,group B,associate's degree,standard,none,group1,71,83,78
6,female,group B,some college,standard,completed,group1,88,95,92
7,male,group B,some college,free/reduced,none,group1,40,43,39
8,male,group D,high school,free/reduced,completed,group1,64,64,67
9,female,group B,high school,free/reduced,none,group1,38,60,50

# №3

In [358]:
df.shape

(1000, 9)

# №4

In [359]:
df.describe()

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

# №5

In [360]:
df.isna().sum().sum()

0

# №6

In [361]:
print(' mean math score: '+str(df['math score'].mean()),'\n',
    'mean reading score: '+str(df['reading score'].mean()),'\n',
    'mean writing score: '+str(df['writing score'].mean()))

 mean math score: 66.089
 mean reading score: 69.169
 mean writing score: 68.054

# №7

In [362]:
df[df['test preparation course']=='none'].mean(numeric_only=True)

math score       64.077882
reading score    66.534268
writing score    64.504673
dtype: float64

In [363]:
df[df['test preparation course']=='completed'].mean(numeric_only=True)

math score       69.695531
reading score    73.893855
writing score    74.418994
dtype: float64

# №8

In [364]:
df['lunch'].unique()

array(['standard', 'free/reduced'], dtype=object)

# №9

In [365]:
df = df.rename(columns={"parental level of education": "education", "test preparation course": "test preparation"})

In [388]:
df.head()

,gender,race/ethnicity,education,lunch,test preparation,group,math score,reading score,writing score,math_PassStatus,reading_PassStatus,writing_PassStatus
0,female,group B,bachelor's degree,standard,none,group1,72,72,74,P,P,P
1,female,group C,some college,standard,completed,group1,69,90,88,P,P,P
2,female,group B,master's degree,standard,none,group1,90,95,93,P,P,P
3,male,group A,associate's degree,free/reduced,none,group1,47,57,44,F,P,F
4,male,group C,some college,standard,none,group1,76,78,75,P,P,P

# №10

In [367]:
passmark = 50

In [368]:
df[df['math score'] >= passmark].shape[0] / df['math score'].shape[0]

0.865

In [369]:
df[(df['math score'] >= passmark) & (df['test preparation'] == 'completed')].shape[0] / df['math score'].shape[0]

0.33

In [370]:
df[(df['math score'] >= passmark) & (df['test preparation'] == 'none') & (df['gender'] == 'female')].shape[0] / df['math score'].shape[0]

0.264

# №11

In [371]:
%%time
df.groupby(['race/ethnicity']).mean()['reading score']

CPU times: user 1.26 ms, sys: 0 ns, total: 1.26 ms
Wall time: 1.12 ms

race/ethnicity
group A    64.674157
group B    67.352632
group C    69.103448
group D    70.030534
group E    73.028571
Name: reading score, dtype: float64

In [372]:
%%time
df.groupby(['education']).min()['writing score']

CPU times: user 4.79 ms, sys: 0 ns, total: 4.79 ms
Wall time: 4.6 ms

education
associate's degree    35
bachelor's degree     38
high school           15
master's degree       46
some college          19
some high school      10
Name: writing score, dtype: int64

# №12

In [519]:
%%time
group_a = np.array(df[(df['race/ethnicity']=='group A')]['reading score'])
group_b = np.array(df[(df['race/ethnicity']=='group B')]['reading score'])
group_c = np.array(df[(df['race/ethnicity']=='group C')]['reading score'])
group_d = np.array(df[(df['race/ethnicity']=='group D')]['reading score'])
group_e = np.array(df[(df['race/ethnicity']=='group E')]['reading score'])
mean_a = 0
mean_b = 0
mean_c = 0
mean_d = 0
mean_e = 0
for i in range(len(group_a)):
    mean_a += group_a[i]
mean_a = mean_a / len(group_a)

for i in range(len(group_b)):
    mean_b += group_b[i]
mean_b = mean_b / len(group_b)

for i in range(len(group_c)):
    mean_c += group_c[i]
mean_c = mean_c / len(group_c)

for i in range(len(group_d)):
    mean_d += group_d[i]
mean_d = mean_d / len(group_d)

for i in range(len(group_e)):
    mean_e += group_e[i]
mean_e = mean_e / len(group_e)
print(mean_a, mean_b, mean_c, mean_d, mean_e)

64.67415730337079 67.35263157894737 69.10344827586206 70.03053435114504 73.02857142857142
CPU times: user 1.16 ms, sys: 2 ms, total: 3.16 ms
Wall time: 2.95 ms

In [520]:
%%time
group_1 = np.array(df[(df['education']=="associate's degree")]['writing score'])
group_2 = np.array(df[(df['education']=="bachelor's degree")]['writing score'])
group_3 = np.array(df[(df['education']=="high school")]['writing score'])
group_4 = np.array(df[(df['education']=="master's degree")]['writing score'])
group_5 = np.array(df[(df['education']=="some college")]['writing score'])
group_6 = np.array(df[(df['education']=="some high school")]['writing score'])
print(min(group_1), min(group_2), min(group_3), min(group_4), min(group_5), min(group_6))

35 38 15 46 19 10
CPU times: user 3.14 ms, sys: 45 µs, total: 3.18 ms
Wall time: 3.3 ms

# №13

In [374]:
grouped = pd.pivot_table(data=df, index=['gender', 'education'], aggfunc={'math score': np.mean,
                                                                        'reading score': np.mean,
                                                                        'writing score': np.mean})
grouped

                           math score  reading score  writing score
gender education
female associate's degree   65.250000      74.120690      74.000000
       bachelor's degree    68.349206      77.285714      78.380952
       high school          59.351064      68.202128      66.691489
       master's degree      66.500000      76.805556      77.638889
       some college         65.406780      73.550847      74.050847
       some high school     59.296703      69.109890      68.285714
male   associate's degree   70.764151      67.433962      65.405660
       bachelor's degree    70.581818      68.090909      67.654545
       high school          64.705882      61.480392      58.539216
       master's degree      74.826087      73.130435      72.608696
       some college         69.009259      64.990741      63.148148
       some high school     67.840909      64.693182      61.375000

# №14 and №15

In [459]:
def func_14_15(a, df, passmark):
    df[a+'_PassStatus'] = np.zeros(df.shape[0])
    for i in range(df.shape[0]):
        if df[a +' score'][i] < passmark:
            df[a +'_PassStatus'][i] = 'F'
            df['OverAll_PassStatus'][i] = 'F'
        else:
            df[a +'_PassStatus'][i] = 'P'
    return df[a +'_PassStatus']


df['OverAll_PassStatus'] = 'P'
func_14_15('math', df, passmark)
func_14_15('reading', df, passmark)
func_14_15('writing', df, passmark)
df.head()

,gender,race/ethnicity,education,lunch,test preparation,group,math score,reading score,writing score,math_PassStatus,reading_PassStatus,writing_PassStatus,OverAll_PassStatus
0,female,group B,bachelor's degree,standard,none,group1,72,72,74,P,P,P,P
1,female,group C,some college,standard,completed,group1,69,90,88,P,P,P,P
2,female,group B,master's degree,standard,none,group1,90,95,93,P,P,P,P
3,male,group A,associate's degree,free/reduced,none,group1,47,57,44,F,P,F,F
4,male,group C,some college,standard,none,group1,76,78,75,P,P,P,P

In [460]:
print('math test passed: '+ str(df[df['math_PassStatus']=='P'].shape[0]), '\n',
      'reading test passed: '+ str(df[df['reading_PassStatus']=='P'].shape[0]), '\n',
      'writing test passed: '+ str(df[df['writing_PassStatus']=='P'].shape[0]), '\n'
     )
print('math test not passed: '+ str(df.shape[0]-df[df['math_PassStatus']=='P'].shape[0]), '\n',
     'reading test not passed: '+ str(df.shape[0]-df[df['reading_PassStatus']=='P'].shape[0]), '\n',
      'writing test not passed: '+ str(df.shape[0]-df[df['writing_PassStatus']=='P'].shape[0]), '\n'
     )

math test passed: 865
 reading test passed: 910
 writing test passed: 886

math test not passed: 135
 reading test not passed: 90
 writing test not passed: 114

# №15(print)

In [461]:
print('passed all tests: ' + str(df[df['OverAll_PassStatus']=='P'].shape[0]))

passed all tests: 812

# №16

In [493]:
def GetGrade(average_grade):
    for i in range(average_grade.shape[0]):
        if average_grade[i] >= 90:
            df['Grade'][i] = 'A'
        if average_grade[i] < 90 and average_grade[i]>= 80:
            df['Grade'][i] = 'B'
        if average_grade[i] < 80 and average_grade[i]>= 70:
            df['Grade'][i] = 'C'
        if average_grade[i] < 70 and average_grade[i]>= 60:
            df['Grade'][i] = 'D'
        if average_grade[i] < 60 and average_grade[i]>= 50:
            df['Grade'][i] = 'E'
        if average_grade[i] < 50:
            df['Grade'][i] = 'F(Fail)'
    return df['Grade']

df['Grade'] = ''
average_grade = (df['math score'] + df['reading score'] + df['writing score']) / 3
GetGrade(average_grade)
df['Grade'].value_counts()

C          261
D          256
E          182
B          146
F(Fail)    103
A           52
Name: Grade, dtype: int64

In [521]:
df.head()

,gender,race/ethnicity,education,lunch,test preparation,group,math score,reading score,writing score,math_PassStatus,reading_PassStatus,writing_PassStatus,OverAll_PassStatus,Grade
0,female,group B,bachelor's degree,standard,none,group1,72,72,74,P,P,P,P,C
1,female,group C,some college,standard,completed,group1,69,90,88,P,P,P,P,B
2,female,group B,master's degree,standard,none,group1,90,95,93,P,P,P,P,A
3,male,group A,associate's degree,free/reduced,none,group1,47,57,44,F,P,F,F,F(Fail)
4,male,group C,some college,standard,none,group1,76,78,75,P,P,P,P,C